Revit 2027 API
DocumentVersion.VersionGUID Property
 The GUID portion of the DocumentVersion. The GUID is updated when changes are made to the document, but may not update with every change to the document. The GUID and save number are both necessary to uniquely identify a document version.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid VersionGUID { get; }
Public ReadOnly Property VersionGUID As Guid
	Get
public:
property Guid VersionGUID {
	Guid get ();
}
member VersionGUID : Guid with get
Property Value
Guid
See Also
Reference
DocumentVersion Class
Autodesk.Revit.DB Namespace